Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Dealing with bugs and bug reports is unglamorous work; not something ideally suited to volunteer labour, but that is all that we have.
es_es: Tratar con errores e informes de errores es un trabajo poco atractivo; no es algo ideal para un trabajo voluntario, pero eso es todo lo que tenemos.

source: If EXPR is omitted, splits the C<$_> string.
es_es: Si EXPR es omitido, divide la cadena C<$_>.

source: Removed F<libgdbm> for AIX 5L and 6.1.
es_es: Eliminado F<libgdbm> de AIX 5L y 6.1.

source: Craig Berry was tireless in getting maint to run under VMS, no matter how many times we broke it for him.
es_es: Craig Berry fue incansable en conseguir que se ejecutara maint en VMS, sin importar cuántas veces lo rompíamos.

source: Note that 0 is a valid match offset.
es_es: Tenga en cuenta que 0 es un desplazamiento válido de la coincidencia.

source: There may be other reasons you can't actually read, write, or execute the file: for example network filesystem access controls, ACLs (access control lists), read-only filesystems, and unrecognized executable formats.
es_es: Puede haber otras razones por las que no pueda leer, escribir o ejecutar un archivo: por ejemplo, controles de acceso a sistemas de archivos en red, ACL (listas de control de acceso), sistemas de archivos de solo lectura, y formatos irreconocibles de ejecutables.

source: Some more examples are
es_es: Algunos ejemplos más

source: perlmodstyle - Perl module style guide
es_es: perlmodstyle - Guía de estilo de los módulos Perl

source: {n}+ Match exactly n times and give nothing back (redundant)
es_es: {n}+ Coincide exactamente n veces y no devuelve nada (redundante)

source: Match at least n times, not greedily
es_es: Coincide al menos n veces, sin avaricia

source: the commas on the right of the sort are evaluated before the sort, but the commas on the left are evaluated after.
es_es: las comas a la derecha de sort son evaluadas antes que el sort, pero las comas a la izquierda se evalúan después.

source: Using Unicode keys with tied hashes should now work correctly.
es_es: Usando claves Unicode con hashes enlazados ahora debería funcionar correctamente.

source: Upgraded from version 6.42 to 6.55_02.
es_es: Actualizado desde la versión 6.42 a la 6.55_02.

source: One can get thread status, or the list of running or joinable threads.
es_es: Se puede obtener el estado de un hilo, o la lista de hilos en ejecución o acoplables.

source: =head2 What modules and extensions are available for Perl?
es_es: =head2 ¿Qué módulos y extensiones están disponibles para Perl?

source: =item opendir DIRHANDLE,EXPR X<opendir>
es_es: =item opendir IDENTIFICADOR_DIR,EXPR X<opendir>

source: There are no changes intentionally incompatible with 5.12.2.
es_es: No hay cambios intencionadamente incompatibles con 5.12.2.

source: See L<perlipc> for details.
es_es: Vea L<perlipc> para más detalles.

source: If the input string is longer than needed, remaining characters are ignored.
es_es: Si la cadena de entrada es más larga de lo necesario, los caracteres sobrantes se ignoran.

source: The require function will look for the "F<Foo::Bar>" file in the @INC array and will complain about not finding "F<Foo::Bar>" there.
es_es: La función require buscará por el archivo "F<Foo::Bar>" en los directorios especificados por el array C<@INC> y se quejará de que no lo encuentra.

source: =item state EXPR : ATTRS
es_es: =item state EXPR : ATRIBS

source: =item "You"
es_es: =item "Usted"

source: Having fewer than 3 digits may lead to a misleading warning message that says that what follows is ignored.
es_es: Tener menos de 3 dígitos puede dar lugar a un mensaje de advertencia engañoso, que dice que lo que sigue es ignorado.

source: # guarantee stability, regardless of algorithm
es_es: # garantiza estabilidad, sin importar el algoritmo

source: When operations on data vary according to data type (making polymorphic invocation of methods feasible)
es_es: Cuando las operaciones en los datos varían de acuerdo al tipo de datos (haciendo factible la invocación de métodos polimórficos)

source: or
es_es: o

source: Your module should also handle taint-checking where appropriate, though this can cause difficulties in many cases.
es_es: El módulo también debe manejar comprobaciones de pringue, aunque esto puede causar dificultades en muchos casos.

source: Last update: 2004-12-16
es_es: Última actualización: 2004-12-16

source: Tests for features of how perl actually runs, including exit codes and handling of PERL* environment variables.
es_es: Pruebas de las características de funcionamiento de perl, incluidos los códigos de salida y el control de las variables de entorno PERL*.

source: This timeline hopefully helps a bit: it lists the new major releases, their maintenance releases, and the development releases.
es_es: Esta línea de tiempo, con suerte, le ayudará un poco: lista los lanzamientos importantes, sus programas de mantenimiento y las versiones de desarrollo.

source: Use comp.lang.perl.misc for topics which do not have a more-appropriate specific group.
es_es: Use comp.lang.perl.misc para temas para los que no exista un grupo específico más apropiado.

# print join(':', split(/W/, 'hi there!', -1)), " ";
source: print join(':', split(/\W/, 'hi there!', -1)), "\n";
es_es: print join(':', split(/\W/, 'hola aqui!', -1)), "\n";

source: I<TPJ> has columns on web development, databases, Win32 Perl, graphical programming, regular expressions, and networking, and sponsors the Obfuscated Perl Contest and the Perl Poetry Contests.
es_es: I<TPJ> incluye columnas sobre desarrollo web, bases de datos, Perl para Win32, programación gráfica, expresiones regulares o conexión a redes. También patrocinó el concurso de ofuscación de código Perl y los concursos de poesía Perl.

source: A string which is (possibly) interpolated and then executed as a system command with C</bin/sh> or its equivalent.
es_es: Una cadena que es (posiblemente) interpolada y luego ejecutada como un comando del sistema con C</bin/sh> o su equivalente.

source: This may alter the usual smart match semantics.
es_es: De esta manera se altera la semántica normal de la coincidencia inteligente.

source: Your SYNOPSIS section should contain a minimal example of use (perhaps as little as one line of code; skip the unusual use cases or anything not needed by most users); the DESCRIPTION should describe your module in broad terms, generally in just a few paragraphs; more detail of the module's routines or methods, lengthy code examples, or other in-depth material should be given in subsequent sections.
es_es: Su sección SINOPSIS debe contener un ejemplo mínimo de uso (quizás tan sólo una línea de código; evitar los casos de uso inusuales o cualquier cosa que no sea necesaria para la mayoría de los usuarios); la DESCRIPCIÓN debe describir el módulo en términos generales, por lo general en sólo unos pocos párrafos; más detalles de las rutinas del módulo o métodos, ejemplos con código más largo, u otro material en profundidad se debe dar en las secciones siguientes.

source: Treats the string in EXPR as a bit vector made up of elements of width BITS and returns the value of the element specified by OFFSET as an unsigned integer.
es_es: Trata a la cadena en EXPR como un vector de bits compuesta de elementos de tantos BITS de ancho y devuelve el valor del elemento especificado por el DESPLAZAMIENTO como un entero sin signo.

source: This has been fixed.
es_es: Esto ha sido corregido.

source: perltie Perl objects hidden behind simple variables
es_es: perltie Objetos Perl ocultos en variables simples

source: $x = (($foo,$bar) = f()); # set $x to f()'s return count
es_es: $x = (($foo,$bar) = f()); # pone $x al número de valores devueltos por f()

source: print $animals[1]; # prints "llama"
es_es: print $animales[1]; # imprime "llama" en pantalla

source: =item printf FORMAT, LIST
es_es: =item printf FORMATO, LISTA

source: If EXPR is omitted, returns the length of C<$_>.
es_es: Si EXPR se omite, devuelve la longitud de C<$_>.

source: A potential problem caught by C<use strict;> will cause your code to stop immediately when it is encountered, while C<use warnings;> will merely give a warning (like the command-line switch B<-w>) and let your code run.
es_es: Un posible problema detectado por C<use strict;> hará que el código se detenga inmediatamente, mientras que C<use warnings;> (al igual que el modificador de línea de comandos B<-w>) sólo mostrará una advertencia y dejará que el código se ejecute.

source: See L<"Numeric operators and numeric conversions"> for details.)
es_es: Encontrará información detallada en L<"Operadores numéricos y conversiones numéricas">.)

source: If there are no parentheses, it returns a list of all the matched strings, as if there were parentheses around the whole pattern.
es_es: Si no hay paréntesis, devuelve una lista de todas las cadenas coincidentes, como si hubiera paréntesis alrededor de todo el patrón.

source: Pack and unpack can operate in two modes: character mode (C<C0> mode) where the packed string is processed per character, and UTF-8 mode (C<U0> mode) where the packed string is processed in its UTF-8-encoded Unicode form on a byte-by-byte basis.
es_es: pack y unpack pueden funcionar de dos modos: modo de caracteres (modo C<C0>) donde la cadena empaquetada es procesada por cada carácter, y el modo UTF-8 (modo C<U0>) donde la cadena empaquetada es procesada en su formato codificado en UTF-8, byte a byte.

source: PUSH this, LIST
es_es: PUSH este, LISTA

source: =head2 Development
es_es: =head2 Desarrollo

source: This means the following behavior holds:
es_es: Esto significa que el siguiente comportamiento cumple que:

source: Since changing a slice changes the original array or hash that it's slicing, a C<foreach> construct will alter some--or even all--of the values of the array or hash.
es_es: Debido a que alterar una porción altera al array o hash original, una construcción C<foreach> alterará algunos -o incluso todos- los valores del array o hash.

source: If the output is empty and C<$@> already contains a value (typically from a previous eval) that value is reused after appending C<"\t...propagated">.
es_es: Si la LISTA está vacía y C<$@> ya contiene un valor (típicamente de un eval() anterior) este valor es reutilizado después de añadirle C<"\t...propagated">.

source: Respects current LC_CTYPE locale.
es_es: Respeta la actual configuración regional LC_CTYPE.

source: At startup Perl blocks the SIGFPE signal away since there isn't much Perl can do about it.
es_es: En el arranque, Perl bloquea la señal SIGFPE, ya que no hay mucho que Perl pueda hacer al respecto.

source: The C<last> command is like the C<break> statement in C (as used in loops); it immediately exits the loop in question.
es_es: El comando C<last> es como la instrucción C<break> del C (usada en bucles); inmediatamente sale del bucle en cuestión.

source: Note that if this operator is used and NOT inside of an alternation then it acts exactly like the C<(*PRUNE)> operator.
es_es: Tenga en cuenta que si este operador es usado, y NO dentro de una alternancia, entonces actúa exactamente igual que el operador C<(*PRUNE)>.

source: If you are upgrading from an earlier release such as 5.6.1, first read the L<perl58delta>, which describes differences between 5.6.0 and 5.8.0, and the L<perl581delta>, which describes differences between 5.8.0 and 5.8.1.
es_es: Si está actualizando desde una versión anterior como la 5.6.1, primero lea L<perl58delta>, que describe las diferencias entre 5.6.0 y 5.8.0, y L<perl581delta>, que describe las diferencias entre 5.8.0 y 5.8.1.

source: Just what is in the packed string depends on LEVEL and OPTNAME; consult getsockopt(2) for details.
es_es: Lo que exactamente esté en la cadena empaquetada depende de NIVEL y OPCIÓN; consulte getsockopt(2) para más detalles.

source: L<perlop/"Regexp Quote-Like Operators">.
es_es: Ver L<perlop/"Operadores Regexp entrecomillados">.

source: Prints the value of LIST to STDERR.
es_es: Imprime el valor de LISTA a STDERR.

source: Filehandles must be passed as globs or glob references to be recognized; barewords are considered filenames.
es_es: Identificadores de archivo se deben pasar como comodines o referencias a comodines para que sean reconocidos; las palabras sueltas se consideran como nombres de archivo.

source: If there are no shell metacharacters in the argument, it is split into words and passed directly to C<execvp>, which is more efficient.
es_es: Si no hay metacaracteres shell en el argumento, es dividido en palabras y pasadas directamente a C<execvp>, que es más eficiente.

source: The C<open> pragma can be used to establish default I/O layers.
es_es: El pragma C<open> puede ser usado para establecer las capas I/O por defecto.

source: However, Topaz provided valuable insights to the next version of Perl and its implementation, but was ultimately abandoned.
es_es: La experiencia proporcionada por Topaz resultó muy útil para la siguiente versión de Perl y su implementación, pero el proyecto acabó por abandonarse.

source: =item m/PATTERN/msixpodualgc X<m> X<operator, match> X<regexp, options> X<regexp> X<regex, options> X<regex> X</m> X</s> X</i> X</x> X</p> X</o> X</g> X</c>
es_es: =item m/PATRÓN/msixpodualgc X<m> X<operator, match> X<regexp, options> X<regexp> X<regex, options> X<regex> X</m> X</s> X</i> X</x> X</p> X</o> X</g> X</c> X<operador, coincidencia> X<opciones, regex> X<opciones, regexp>

source: Finally, a side effect of the current implementation is that the effects of C<shift @_> can I<normally> be undone (but not C<pop @_> or other splicing, I<and> not if a reference to C<@_> has been taken, I<and> subject to the caveat about reallocated elements), so C<@DB::args> is actually a hybrid of the current state and initial state of C<@_>.
es_es: Por último, un efecto secundario de la implementación actual es que los efectos de C<shift @_> pueden I<normalmente> ser deshechos (pero no C<pop @_> u otras operaciones de troceado, I<y> tampoco si se ha tomado una referencia a C<@_>, I<y> con la salvedad sobre los elementos reasignados), por lo que C<@DB::args> es realmente un híbrido del estado actual e inicial de C<@_>.

source: This document describes various features of Irix that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es_es: Este documentos describe varias características de Irix que afectarán a cómo Perl versión 5 (de ahora en adelante sólo Perl) es compilado y/o ejecutado.

source: Some Irix cc versions, e.g. 7.3.1.1m (try cc -version) have been known to have issues (coredumps) when compiling perl.c.
es_es: Algunas versiones de cc de Irix, por ejemplo, la 7.3.1.1m (pruebe cc -version) se sabe que tienen problemas (coredumps) al compilar perl.c.

source: See F<INSTALL>.
es_es: Vea F<INSTALL>.

source: Starting from the beginning of the template to pack(), each pair of characters is converted to 1 character of output.
es_es: A partir del comienzo de la plantilla a pack(), cada par de caracteres se convierte en un carácter en la salida.

source: This is due to bugs in Haiku's network stack implementation.
es_es: Esto se debe a errores en la implementación de la pila del sistema de red de Haiku.

source: If the terminating string is quoted, the type of quotes used determine the treatment of the text.
es_es: Si la cadena de terminación está entrecomillada, el tipo de comillas usadas determinan el tratamiento del texto.

source: (.*)(\d+) <I have 2 numbers: 5314> <7>
es_es: (.*)(\d+) <Tegno 2 números: 5314> <7>

source: Dave Mitchell provided a fix.
es_es: Dave Mitchell proporcionó un arreglo.

source: The precedence of "and" and "or" is much lower, however, so that you can safely use them after a list operator without the need for parentheses:
es_es: Sin embargo, la precedencia de "and" y "or" es mucho menor, de modo que usted puede usarlos con seguridad después de un operador de lista sin necesidad de paréntesis:

source: An exception to this is the C<:encoding> layer that changes the default character encoding of the handle; see L</open>.
es_es: Una excepción a esto es la capa C<:encoding> que cambia la codificación por defecto del identificador de archivo; ver L</open>.

source: =item setpriority WHICH,WHO,PRIORITY X<setpriority> X<priority> X<nice> X<renice>
es_es: =item setpriority CUÁL,QUIÉN,PRIORIDAD X<setpriority> X<priority> X<nice> X<renice> X<prioridad>

source: See L</when>.
es_es: Vea L</when>.

source: Perl has a new -dt command-line flag, which enables threads support in the debugger.
es_es: Perl tiene una nueva bandera de línea de comandos llamada -dt, que activa el soporte de hebras en el depurador.

source: See L<feature>.
es_es: Ver L<feature>.

source: Use look-behind instead (see below).
es_es: Use en su lugar el antecedente (I<look-behind>) (vea más abajo).

source: He previously used the phrase with many subjects ("Just another x hacker,"), so to distinguish his JAPH, he started to write them as Perl programs:
es_es: Previamente había utilizado esta frase con muchos sujetos distintos ("Just another x hacker,"), así que para distinguir su JAPH decidió empezar a escribir la firma como un programa Perl:

source: But in all other cases, you should decode it.
es_es: Pero en todos los demás casos debe hacerlo.

source: if (exists $hash{A}{B}[$ix]) { }
es_es: if (exists $hash{A}{B}[$i]) { }

source: jJfFdDpP (The "little end" touches the construct.)
es_es: jJfFdDpP (El "little end" toca la construcción).

source: The collected standard output of the command is returned; standard error is unaffected.
es_es: Todo lo que salga por la salida estándar del comando se devuelve; la salida estándar de error no se verá afectada.

source: You may therefore need to use multiple formlines to implement a single record format, just like the C<format> compiler.
es_es: Puede por eso necesitar usar múltiples formlines para implementar un único registro format, como lo hace el propio compilador de C<format>.

source: If that doesn't work (some I/O implementations are particularly cantankerous), you might need something like this:
es_es: Si eso no funciona (algunas implementaciones de E/S son particularmente irritables), puede que tenga que hacer algo como esto:

source: The other rules are likely to contradict the user's expectations much less frequently than this first one.
es_es: Las demás normas es probable que contradigan las expectativas del usuario con mucha menos frecuencia que ésta primera.

source: B<NOTE>: Failed matches in Perl do not reset the match variables, which makes it easier to write code that tests for a series of more specific cases and remembers the best match.
es_es: B<NOTA>: Coincidencias fallidas en perl no reinicializan las variables de coincidencia, lo que facilita escribir código que haga comprobaciones para una serie específica de casos y recuerde la mejor coincidencia.

source: This allows for computed C<goto>s per FORTRAN, but isn't necessarily recommended if you're optimizing for maintainability:
es_es: Esto permite crear C<goto> calculados como en FORTRAN, pero no está necesariamente recomendado si usted está optimizando, durante el mantenimiento:

source: unpack("x$where a$howmuch", $what);
es_es: unpack("x$donde a$cuanto", $que);

source: The conditions can be any Perl expression.
es_es: Una condición puede ser cualquier expresión Perl.

source: =item Keywords related to the control flow of your Perl program X<control flow>
es_es: =item Palabras clave relativas al control de flujo de su programa Perl X<control flow> X<control de flujo>

# chdir '/usr/spool/news' or die "Can't cd to spool: $! "
source: chdir '/usr/spool/news' or die "Can't cd to spool: $!\n"
es_es: chdir '/usr/spool/news' or die "No puedo entrar en spool/: $!\n"

source: the pattern is encoded in UTF-8; or
es_es: el patrón está codificado en UTF-8; o

source: The $members value returned by I<getgr*()> is a space-separated list of the login names of the members of the group.
es_es: El valor de $miembros devuelto por I<getgr*()> es una lista separada por espacios de los nombres de login de los miembros del grupo.

source: This is the only form of quoting in perl where there is no need to worry about escaping content, something that code generators can and do make good use of.
es_es: Esta es la única forma de entrecomillar en Perl donde no es necesario preocuparse por el escapado del contenido, algo que los generadores de código pueden y hacen buen uso de él.

source: You can also import the symbolic C<S_I*> constants from the C<Fcntl> module:
es_es: También puede importar las constantes simbólicas C<S_I*> desde el módulo Fcntl:

source: C<\1> in the replacement of C<s'''> does not work as C<$1>.
es_es: C<\1> en el reemplazo de C<s'''> no funciona como C<$1>.

source: This will help people find and remember your module, and make programming with your module more intuitive.
es_es: Esto ayudará a la gente a encontrar y recordar su módulo, y hacer la programación con el módulo de forma más intuitiva.

source: (At one point C<$0> did also, but now it returns the name of the program.) C<$`> returns everything before the matched string.
es_es: (Hace un tiempo, C<$0> también lo hacía, pero ahora devuelve el nombre del programa). C<$`> devuelve todo lo anterior a la cadena coincidente.

source: The defaults assume a little endian LP32 platform - ie long and pointers are 32 bits, so sizeof(long) and sizeof(void *) are 4 If your platform is little endian LP64 - ie long and pointers are 64 bits, sizeof(long) and sizeof(void *) are 8, then you first need to run
es_es: Los valores por defecto asumen una plataforma little-endian LP32 - es decir, los largos y punteros son de 32 bits, por lo que sizeof(long) y sizeof(void *) son 4 Si su plataforma es little-endian LP64 - es decir, los largos y punteros son de 64 bits, sizeof(long) y sizeof(void *) son 8, entonces primero tiene que ejecutar

source: This is deprecated in favour of F<h2xs> these days.
es_es: Han quedado obsoletos desde que surgió F<h2xs>.

source: perlreguts Perl regular expression engine internals
es_es: perlreguts Componentes del motor de expresiones regulares

source: Another mnemonic for this modifier is "Depends", as the rules actually used depend on various things, and as a result you can get unexpected results.
es_es: Otra regla mnemotécnica para este modificador es "Depende", porque las reglas utilizadas realmente dependen de varias cosas, y como resultado se puede obtener resultados inesperados.

source: This largely eliminates the need for typeglobs when opening filehandles that must be passed around, as in the following example:
es_es: Esto elimina en gran medida la necesidad de typeglobs al abrir identificadores de archivo que deberían ser traspasados, como en el ejemplo siguiente:

source: A new operator C<//> (defined-or) will be available.
es_es: Un nuevo operador C<//> (definido-o) estará disponible.

source: Perl.com ( http://www.perl.com/ ) used to be part of the O'Reilly Network, a subsidiary of O'Reilly Media.
es_es: Anteriormente, Perl.com ( http://www.perl.com/ ) formaba parte de O'Reilly Network, una subsidiaria de O'Reilly Media.

source: The next step is interpolation in the text obtained, which is now delimiter-independent.
es_es: El siguiente paso es la interpolación del texto obtenido, que ahora es independiente del delimitador.

source: Returns the number of bytes actually written, or C<undef> if there was an error (in this case the errno variable C<$!> is also set).
es_es: Devuelve el número de bytes realmente escritos, o C<undef> si hubo un error (en este caso, también se establece la variable C<$!>).

source: LOOP: {
es_es: BUCLE: {
